# -*- coding: utf-8 -*-

token = ''

google_string = 'https://www.google.ru#newwindow=1&q='
sputnik_string = 'http://www.sputnik.ru/search?q='

hashtag = {'#убабушки' : ('бабушка',
                          'бабушки',
                          'бабули',
                          'бабуля',
                          'бабка',),
           '#ясузбекистана' : ('узбек',
                               'узбеки',
                               'узбечка',
                               'узбечки',
                               'кишлак',
                               'узбекситана',
                               'узбекистан'),
           '#ше_не_вмерла' : ('украина',
                              'украине',
                              'хохлы',
                              'хохлов',
                              'хохол'),
           '#вата' : ('рашке',
                      'рашка',
                      'ватник',
                      'ватники'),
           '#картоха' : ('белорашке',
                         'белорашке',
                         'белоруссия',
                         'белоруссии'),
           '#УЧАЛЫ' : ('учалы',
                       'учалах')}

weather_key = ('погода', 'погоду', 'погоде', 'погодой')
weather = ('говно', 'херовая', 'пойдет',
           'хз', 'как всегда', 'лучше,чем твоя рожа')

weather_rambler = "https://weather.rambler.ru/"
weather_hash = {'минске' : 'v-minske/',
                'москве' : 'v-moskve/',
                'екатеринбурге' : 'v-ekaterinburge/',
                'ростове' : 'v-rostove-na-donu/',
                'омске' : 'v-omske/',
                'учалах' : 'v-uchalakh/',
                'учалы' : 'v-uchalakh/',
                'ташкенте' : 'v-tashkente/',
                'ташкент' : 'v-tashkente/'}

time_key = ('время', 'времени', 'часов', 'час')

bad_word_key = ('бот', 'мудак', 'урод', 'параша')


